First need to install library (with pip or conda): Pandas

## Series

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30} #dictionary

In [5]:
pd.Series(my_data)
#gives us a default index (0, 1, 2) for the data (10, 20, 30)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(my_data, labels)
# (data, index)
# gives us the index we specified (labels = a,b,c) for the data

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr, labels)
# (data, index)
# can use an array just like a list

a    10
b    20
c    30
dtype: int32

#### can create Series from dictionary

In [8]:
pd.Series(d) 
#can pass a DICTIONARY, where the keys become the index

a    10
b    20
c    30
dtype: int64

##### Panda Series can hold a variety of data types (unlike arrays which can only hold numbers)

In [9]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])
# (data, index)
ser1
# so the country names are the indexes, and the numbers are the data

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [10]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [11]:
#get data out like you would  a dictionary
ser1['USA']

1

In [12]:
ser3 = pd.Series(labels)
ser3

0    a
1    b
2    c
dtype: object

In [13]:
ser3[0]

'a'

In [14]:
ser1 + ser2
#where there's not a matching index, you get a null

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [15]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

## DataFrames

In [16]:
from numpy.random import randn

In [17]:
np.random.seed(101) #this is a way to get "consistent" random numbers. 
# wouldn't use this normally

In [18]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'],['W','X','Y','Z']) # like a series, but also has a Columns argument
# (data, index/rows, columns)
df 
#it's basically several series (columns) that share the same index (rows)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
#Get Basic metadata info
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
W    5 non-null float64
X    5 non-null float64
Y    5 non-null float64
Z    5 non-null float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [20]:
# How to get data out?
df['W'] 
#gets the W column

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [21]:
type(df['W']) #see? a dataframe column is a series

pandas.core.series.Series

In [22]:
type(df)

pandas.core.frame.DataFrame

In [23]:
df[['W', 'X']] # to GEt multiple COLUMNS, input a LIST (so need extra brackets)

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [24]:
#to CREATE A NEW COLUMN
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [25]:
#to REMOVE COLUMN
df.drop('new',1) 
#need to specify the axis as "1" because default axis 0 is the index

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
#NOTE: the drop doesn't actually MODIFY the dataframe
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [27]:
#IF you want to actually REMOVE from DATAFRAME, need to also specify "inplace"
df.drop('new',axis=1,inplace=True)

In [28]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
df.drop('E') #can also drop an entire row/index

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [30]:
df.drop('E',inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [31]:
df.loc['C'] #to GET a ROW
#(recall, to get COLUMNS, use df[['W', 'X']])

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [32]:
df.iloc[2] #can also use numerical index using iloc

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [33]:
df.loc['B','Y'] #gets value from ROW B, COLUMN Y (just like numpy)

-0.84807698340363147

In [34]:
df.loc[['A','B'],['W','Y']]
# [ROWS, COlUMNS]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

#### Conditional Selection

In [35]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [36]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True

In [37]:
df[df>0] # will get values where TRUE and NaN (null) where FALSE

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057

In [38]:
df['W']>0

A     True
B     True
C    False
D     True
Name: W, dtype: bool

In [39]:
df[df['W']>0] 
#NOTE: does not give NaNs/nulls because it excludes the rows 
# that do not meet criteria

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [40]:
df[df['W']>0][['X','Y']] 
#since the result of df[df['W']>0] is a dataframe
# you can then get columns or other data futher

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237

In [41]:
# MULTIPLE CONDITIONS
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [42]:
df[(df['W']>1) & (df['Y']>0)]  
# must use "&" instead of "and" because comparing 2 series

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [43]:
df[(df['W']>1) | (df['Y']>0)]  
# pipe | for "or"

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001

In [44]:
df.reset_index() 
#RESET the INDEX to numerical (will not occur inplace unless specified)

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057

In [45]:
newind = 'CA NY WY OR'.split()
newind

['CA', 'NY', 'WY', 'OR']

In [46]:
df['States'] = newind #first, adding newind to df as a new column
df.set_index('States') # SET States as the INDEX

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057

#### Multi Index and Index Hierarchy

In [47]:
# constructing a multi-index level dataframe
outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = '1 2 3 1 2 3'.split()
hier_index = list(zip(outside, inside)) 
#turns 2 lists into list of tuple pairs
hier_index = pd.MultiIndex.from_tuples(hier_index) 
#turns the tuple pairs into multiIndex
print(outside)
print(inside)
hier_index

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
['1', '2', '3', '1', '2', '3']

MultiIndex(levels=[['G1', 'G2'], ['1', '2', '3']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [48]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])
    #(data, index (row labels), column labels)
df
#a multi-index dataframe

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [49]:
df.loc['G1'].loc['1']

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [50]:
df.index.names = ['Groups','Num'] #giving the indexes names
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [51]:
df.loc['G2'].loc['2','B'] #to get value from index G2, index 2, column B

0.072959675317038689

In [52]:
df.loc['G1'].loc['3','A']

-0.13484072060601238

In [53]:
df.xs('1', level = 'Num') 
#get CROSS-SECTION (i.e., can get index 1 from both G1 and G2)

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

### Missing Data

#### Can create DataFrame from Dictionary

In [54]:
d = {'A':[1,2,np.nan],'B':[5, np.nan,np.nan],'C':[1,2,3]} #dictionary
df = pd.DataFrame(d) #create dataFrame
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

#### Can drop ROWS that have nulls/NaNs

In [55]:
df.dropna()  #Note: does not impact inplace (permanently) unless specified

     A    B  C
0  1.0  5.0  1

In [56]:
df.dropna(1) #can specify axis = 1 to drop COLUMNS with NaNs/Nulls

   C
0  1
1  2
2  3

In [57]:
# can set a threshold argument (how many non-null values in order to keep)
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

#### Can fill in missing values

In [58]:
df.fillna('FILL VALUE') #Note: does not operate "inplace" (permanently) unless specified

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [59]:
# for example, might want to fill in with Mean value of column
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### GROUPBY

In [60]:
# i.e., like in SQL, lets you determine where to aggregate (sum, mean, etc)

In [61]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charle','Amy','Vanessa','Amy','Sam'],
       'Sales':[200,120,340,124,243,400]} #created a dictionary

df = pd.DataFrame(data)  #made a DataFrame out of the dictionary
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG   Charle    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB      Amy    243
5      FB      Sam    400

In [62]:
#first, define an object using the groupby method, 
#specifying the column to groupby
byComp = df.groupby('Company') 
byComp.head()

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG   Charle    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB      Amy    243
5      FB      Sam    400

In [63]:
#then, use some aggregate method (sum, mean, etc) on the groupby object
byComp.mean()

         Sales
Company
FB       321.5
GOOG     160.0
MSFT     232.0

In [64]:
byComp.sum()

         Sales
Company
FB         643
GOOG       320
MSFT       464

In [65]:
byComp.std() #standard deviation

              Sales
Company
FB       111.015765
GOOG      56.568542
MSFT     152.735065

In [66]:
#Note: a dataFrame is returned, so can do more with it as a DataFrame

#### Here's how you would do it in one line

In [67]:
df.groupby('Company').max()

          Person  Sales
Company
FB           Sam    400
GOOG         Sam    200
MSFT     Vanessa    340

In [68]:
df.groupby('Company').describe() #gives a bunch of stats

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  321.5  111.015765  243.0  282.25  321.5  360.75  400.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [69]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   321.500000  160.000000  232.000000
      std    111.015765   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    282.250000  140.000000  178.000000
      50%    321.500000  160.000000  232.000000
      75%    360.750000  180.000000  286.000000
      max    400.000000  200.000000  340.000000

### Merging, Joining, Concatenating

In [70]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [71]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [72]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [73]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

#### Concatenation 
Glues together dataframes. Can specify either axis. Dimensions should match along chosen axis.

In [74]:
pd.concat([df1,df2,df3])
# argument is a list of dataframes to concat; default axis = 0 (concats rows)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [75]:
pd.concat([df1,df2,df3],1) #specifies axis = 1, to concat columns

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

#### Merging
Like Join but you can specify key column(s) (i.e., what to join on) instead of index.

In [76]:
Fra1 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
Fra2 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [77]:
Fra1

    A   B key1 key2
0  A0  B0   K0   K0
1  A1  B1   K0   K1
2  A2  B2   K1   K0
3  A3  B3   K2   K1

In [78]:
Fra2

    C   D key1 key2
0  C0  D0   K0   K0
1  C1  D1   K1   K0
2  C2  D2   K1   K0
3  C3  D3   K2   K0

In [79]:
pd.merge(Fra1, Fra2, how='inner', on=['key1', 'key2']) 
#(dataframe1, dataframe2, 'inner' is default...)
#'inner' means only include rows where both dataframes have the key(s)

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

In [80]:
pd.merge(Fra1, Fra2, on=['key1', 'key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

In [81]:
pd.merge(Fra1, Fra2, how='outer', on=['key1', 'key2'])

     A    B key1 key2    C    D
0   A0   B0   K0   K0   C0   D0
1   A1   B1   K0   K1  NaN  NaN
2   A2   B2   K1   K0   C1   D1
3   A2   B2   K1   K0   C2   D2
4   A3   B3   K2   K1  NaN  NaN
5  NaN  NaN   K2   K0   C3   D3

In [82]:
pd.merge(Fra1, Fra2, how='right', on=['key1', 'key2'])

     A    B key1 key2   C   D
0   A0   B0   K0   K0  C0  D0
1   A2   B2   K1   K0  C1  D1
2   A2   B2   K1   K0  C2  D2
3  NaN  NaN   K2   K0  C3  D3

#### Joining
Like Merge but uses the index(es) (default is 'left' join)
Combining columns of two potentially differently-indexed DataFrames

In [83]:
DataA = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

DataB = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [84]:
DataA

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [85]:
DataB

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [86]:
DataA.join(DataB)
#default is 'left' join ; can also specify how = 'inner', 'outer', 'right'

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [87]:
DataA.join(DataB, how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [88]:
DataA.join(DataB, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

### Operations

In [89]:
DataF1 = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
DataF1.head()  #.head() returns first 5 rows (can specify a different number)

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [90]:
# return array of all unique values in column
DataF1['col1'].unique()

array([1, 2, 3, 4], dtype=int64)

In [91]:
# return count of unique values
DataF1['col2'].nunique()

3

In [92]:
# returns the counts of each value
DataF1['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [93]:
#Conditional selection reviewed
DataF1[DataF1['col1']>2]  # returns all the rows where col1 is greater than 2

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [94]:
DataF1[(DataF1['col1']>2) & (DataF1['col2']==444)]

   col1  col2 col3
3     4   444  xyz

#### "apply" Method, also map and apply map

In [95]:
def times2(x):
    return x*2

In [96]:
DataF1['col1'].apply(times2)  

# "apply" method does a function to each item in a column

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [97]:
#especially useful with lambda expressions
DataF1['col3'].apply(lambda x: x*2)  
#the lambda expression is to multiply input times 2

0    abcabc
1    defdef
2    ghighi
3    xyzxyz
Name: col3, dtype: object

In [98]:
DataF1

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [99]:
DataF1.drop('col1', 1)  #need to specify axis = 1 for columns; 
# Note: need to specify inplace to make permanent change

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [100]:
DataF1.columns # to return list of column names

Index(['col1', 'col2', 'col3'], dtype='object')

In [101]:
DataF1.index # to return info on index

RangeIndex(start=0, stop=4, step=1)

In [102]:
DataF1.sort_values('col2')
# sort_values(by which columns)

#Note: the index will stay with the original row
#Note: to make permanent change, specify inplace = True

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [3]:
DataF1.isnull()  
#Returns dataframe with True where values are NaN/null.

NameError: name 'DataF1' is not defined

#### Difference between Apply, Map, and ApplyMap
https://stackoverflow.com/questions/19798153/difference-between-map-applymap-and-apply-methods-in-pandas

Summing up:
- apply can work on a row / column basis of a DataFrame
- applymap can work element-wise on a DataFrame
- map can work element-wise on a Series.
    - map can also take a dictionary as input to automatically convert the elements in the Series (keys) to new elements (values)

#### Pivot Tables

In [104]:
data5 = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df5 = pd.DataFrame(data5)
df5

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [105]:
df5.pivot_table(values = 'D', index=['A','B'], columns=['C'])  
#default aggregation is mean, but can change it

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

### Data Input and Output
Importing data as DataFrame from and exporting to outside sources
first need to install libraries (with pip or conda):
sqlalchemy, lxml, html5lib, and BeautifulSoup4

In [106]:
pwd

'C:\\Users\\Charles\\Documents\\programming\\python'

In [107]:
# reading in (importing) csv file
DataRead1 = pd.read_csv('example')  
#in this case the csv file is in same folder as jupyter notebook; 
#otherwise, would need to specify filepath
DataRead1

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [108]:
DataRead1.to_csv('My_outputcsv',index=False)
#index=False means the index will NOT be its own column
#index = True (default) means the index will be its own column (Unnamed)

In [109]:
pd.read_csv('My_outputcsv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

#### For Excel files, Pandas can ONLY read/import DATA, not formulas, etc.
also, may get error saying no xlrd library; then in command line, run "conda install clrd"

In [110]:
#import/read
DataExcel1 = pd.read_excel('Excel_Sample.xlsx','Sheet1')
#(filepath, sheetname)
DataExcel1

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [111]:
#export/to
DataExcel1.to_excel('Excel_output.xlsx','Newsheet')

#### HTML files

In [112]:
#Looks for table elements in the html file and converts to dataframe
HTMLData1 = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')
HTMLData1

[                                             Bank Name                City  \
 0                                  Fayette County Bank          Saint Elmo
 1    Guaranty Bank, (d/b/a BestBank in Georgia & Mi...           Milwaukee
 2                                       First NBC Bank         New Orleans
 3                                        Proficio Bank  Cottonwood Heights
 4                        Seaway Bank and Trust Company             Chicago
 5                               Harvest Community Bank          Pennsville
 6                                          Allied Bank            Mulberry
 7                         The Woodbury Banking Company            Woodbury
 8                               First CornerStone Bank     King of Prussia
 9                                   Trust Company Bank             Memphis
 10                          North Milwaukee State Bank           Milwaukee
 11                              Hometown National Bank            Longview
 12                                 The Bank of Georgia      Peachtree City
 13                                        Premier Bank              Denver
 14                                      Edgebrook Bank             Chicago
 15                              Doral Bank  En Espanol            San Juan
 16                   Capitol City Bank & Trust Company             Atlanta
 17                             Highland Community Bank             Chicago
 18                    First National Bank of Crestview           Crestview
 19                                  Northern Star Bank             Mankato
 20              Frontier Bank, FSB D/B/A El Paseo Bank         Palm Desert
 21               The National Republic Bank of Chicago             Chicago
 22                                      NBRS Financial          Rising Sun
 23                               GreenChoice Bank, fsb             Chicago
 24                            Eastside Commercial Bank             Conyers
 25                              The Freedom State Bank             Freedom
 26                                         Valley Bank     Fort Lauderdale
 27                                         Valley Bank              Moline
 28                         Slavie Federal Savings Bank             Bel Air
 29                               Columbia Savings Bank          Cincinnati
 ..                                                 ...                 ...
 523                                  ANB Financial, NA         Bentonville
 524                                          Hume Bank                Hume
 525                             Douglass National Bank         Kansas City
 526                                  Miami Valley Bank            Lakeview
 527                                            NetBank          Alpharetta
 528                          Metropolitan Savings Bank          Pittsburgh
 529                                    Bank of Ephraim             Ephraim
 530                                      Reliance Bank        White Plains
 531              Guaranty National Bank of Tallahassee         Tallahassee
 532                                Dollar Savings Bank              Newark
 533                               Pulaski Savings Bank        Philadelphia
 534              First National Bank of Blanchardville      Blanchardville
 535                              Southern Pacific Bank            Torrance
 536                        Farmers Bank of Cheneyville         Cheneyville
 537                                      Bank of Alamo               Alamo
 538             AmTrade International Bank  En Espanol             Atlanta
 539                     Universal Federal Savings Bank             Chicago
 540                       Connecticut Bank of Commerce            Stamford
 541                                   New Century Bank     Shelby Township
 542                              Net 1st National Bank          Boca Raton
 543                                       NextBank, NA             Phoenix
 544                           Oakwood Deposit Bank Co.             Oakwood
 545                              Bank of Sierra Blanca       Sierra Blanca
 546                      Hamilton Bank, NA  En Espanol               Miami
 547                             Sinclair National Bank            Gravette
 548                                 Superior Bank, FSB            Hinsdale
 549                                Malta National Bank               Malta
 550                    First Alliance Bank & Trust Co.          Manchester
 551                  National State Bank of Metropolis          Metropolis
 552                                   Bank of Honolulu            Honolulu

      ST   CERT                Acquiring Institution        Closing Date  \
 0    IL   1802            United Fidelity Bank, fsb        May 26, 2017
 1    WI  30003  First-Citizens Bank & Trust Company         May 5, 2017
 2    LA  58302                         Whitney Bank      April 28, 2017
 3    UT  35495                    Cache Valley Bank       March 3, 2017
 4    IL  19328                  State Bank of Texas    January 27, 2017
 5    NJ  34951  First-Citizens Bank & Trust Company    January 13, 2017
 6    AR     91                         Today's Bank  September 23, 2016
 7    GA  11297                          United Bank     August 19, 2016
 8    PA  35312  First-Citizens Bank & Trust Company         May 6, 2016
 9    TN   9956           The Bank of Fayette County      April 29, 2016
 10   WI  20364  First-Citizens Bank & Trust Company      March 11, 2016
 11   WA  35156                       Twin City Bank     October 2, 2015
 12   GA  35259                        Fidelity Bank     October 2, 2015
 13   CO  34112            United Fidelity Bank, fsb       July 10, 2015
 14   IL  57772             Republic Bank of Chicago         May 8, 2015
 15   PR  32102         Banco Popular de Puerto Rico   February 27, 2015
 16   GA  33938  First-Citizens Bank & Trust Company   February 13, 2015
 17   IL  20290            United Fidelity Bank, fsb    January 23, 2015
 18   FL  17557                       First NBC Bank    January 16, 2015
 19   MN  34983                            BankVista   December 19, 2014
 20   CA  34738    Bank of Southern California, N.A.    November 7, 2014
 21   IL    916                  State Bank of Texas    October 24, 2014
 22   MD   4862                          Howard Bank    October 17, 2014
 23   IL  28462                 Providence Bank, LLC       July 25, 2014
 24   GA  58125            Community & Southern Bank       July 18, 2014
 25   OK  12483      Alva State Bank & Trust Company       June 27, 2014
 26   FL  21793  Landmark Bank, National Association       June 20, 2014
 27   IL  10450                  Great Southern Bank       June 20, 2014
 28   MD  32368                        Bay Bank, FSB        May 30, 2014
 29   OH  32284            United Fidelity Bank, fsb        May 23, 2014
 ..   ..    ...                                  ...                 ...
 523  AR  33901       Pulaski Bank and Trust Company         May 9, 2008
 524  MO   1971                        Security Bank       March 7, 2008
 525  MO  24660       Liberty Bank and Trust Company    January 25, 2008
 526  OH  16848         The Citizens Banking Company     October 4, 2007
 527  GA  32575                           ING DIRECT  September 28, 2007
 528  PA  35353  Allegheny Valley Bank of Pittsburgh    February 2, 2007
 529  UT   1249                        Far West Bank       June 25, 2004
 530  NY  26778                     Union State Bank      March 19, 2004
 531  FL  26838              Hancock Bank of Florida      March 12, 2004
 532  NJ  31330                          No Acquirer   February 14, 2004
 533  PA  27203                       Earthstar Bank   November 14, 2003
 534  WI  11639                        The Park Bank         May 9, 2003
 535  CA  27094                            Beal Bank    February 7, 2003
 536  LA  16445            Sabine State Bank & Trust   December 17, 2002
 537  TN   9961                          No Acquirer    November 8, 2002
 538  GA  33784                          No Acquirer  September 30, 2002
 539  IL  29355               Chicago Community Bank       June 27, 2002
 540  CT  19183                   Hudson United Bank       June 26, 2002
 541  MI  34979                          No Acquirer      March 28, 2002
 542  FL  26652                       Bank Leumi USA       March 1, 2002
 543  AZ  22314                          No Acquirer    February 7, 2002
 544  OH   8966       The State Bank & Trust Company    February 1, 2002
 545  TX  22002     The Security State Bank of Pecos    January 18, 2002
 546  FL  24382     Israel Discount Bank of New York    January 11, 2002
 547  AR  34248                   Delta Trust & Bank   September 7, 2001
 548  IL  32646                Superior Federal, FSB       July 27, 2001
 549  OH   6629                    North Valley Bank         May 3, 2001
 550  NH  34264  Southern New Hampshire Bank & Trust    February 2, 2001
 551  IL   3815              Banterra Bank of Marion   December 14, 2000
 552  HI  21029                   Bank of the Orient    October 13, 2000

            Updated Date
 0          June 1, 2017
 1          June 1, 2017
 2          May 23, 2017
 3          May 18, 2017
 4          May 18, 2017
 5          May 18, 2017
 6     November 17, 2016
 7          June 1, 2017
 8     September 6, 2016
 9     September 6, 2016
 10       March 13, 2017
 11       April 13, 2016
 12     October 24, 2016
 13      August 17, 2016
 14        July 12, 2016
 15         May 13, 2015
 16       April 21, 2015
 17       April 21, 2015
 18          May 8, 2017
 19      January 6, 2016
 20    November 10, 2016
 21      January 6, 2016
 22       March 26, 2015
 23    December 12, 2016
 24        July 11, 2016
 25       March 25, 2016
 26        June 29, 2015
 27        June 26, 2015
 28    December 12, 2016
 29    November 10, 2016
 ..                  ...
 523     August 28, 2012
 524     August 28, 2012
 525    October 26, 2012
 526  September 12, 2016
 527     August 28, 2012
 528    October 27, 2010
 529       April 9, 2008
 530       April 9, 2008
 531        June 5, 2012
 532       April 9, 2008
 533       July 22, 2005
 534        June 5, 2012
 535    October 20, 2008
 536    October 20, 2004
 537      March 18, 2005
 538  September 11, 2006
 539       April 9, 2008
 540   February 14, 2012
 541      March 18, 2005
 542       April 9, 2008
 543    February 5, 2015
 544    October 25, 2012
 545    November 6, 2003
 546  September 21, 2015
 547   February 10, 2004
 548     August 19, 2014
 549   November 18, 2002
 550   February 18, 2003
 551      March 17, 2005
 552      March 17, 2005

 [553 rows x 7 columns]]

In [113]:
HTMLData1[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","June 1, 2017"
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","June 1, 2017"
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","May 23, 2017"
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,"March 3, 2017","May 18, 2017"
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,"January 27, 2017","May 18, 2017"

#### SQL
Pandas probably isn't the best for SQL because it depends on various SQL engines. Generally, it's better to look up specific libraries meant for specific SQL engines.

In [114]:
# that said, here's a generic way
from sqlalchemy import create_engine

In [115]:
#engine = create_engine('sqlite:///:memory:') #creating a sql "database" in memory

In [116]:
#DataExcel1.to_sql('my_table1',engine)

In [117]:
#sqlData1 = pd.read_sql('my_table1'.con=engine)